Tekla Open API Reference for Tekla Structures 2025
GeometrySection.Index Property
 Gets the index of the node
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
GeometrySection Class
Tekla.Structures.Model Namespace